// to enter the prices use persian keyboard and for commo use shift + u key

List<Map> foods = [
  {
    'name': 'چلوفیله کباب ترش',
    'content': 'برنج درجه یک ایرانی، راسته گوساله، گوجه کبابی',
    'price': '720,000 تومان'
  },
  {
    'name': 'چلو کباب سلطانی مخصوص',
    'content':
        'برنج درجه یک ایرانی، یک سیخ کباب برگ، یک سیخ کباب کوبیده، گوجه کبابی',
    'price': '745,000 تومان'
  },
  {
    'name': 'چلو کباب برگ مخصوص',
    'content': 'گوشت فیله ، دورچین ، گوجه',
    'price': '535,000 تومان',
  },
  {
    'name': 'چلو کباب بختیاری',
    'content': 'گوشت فیله ، تیکه مرغ مرینت شده ، دورچین ، گوجه',
    'price': '560,000 تومان',
  },
  {
    'name':'چلو جوجه کباب ترش',
    'content':'برنج درجه یک ایرانی ، جوجه کباب مزه دار شده ، ادویه مخصوص',
    'price':'405,000 تومان',
  },
  {
    'name':'چلو جوجه کباب بدون استخوان',
    'content':'برنج درجه یک ایرانی ، فیله مرغ ، گوجه کبابی',
    'price':'370,000 تومان',
  },
  {
    'name':'چلو کباب لقمه مخصوص',
    'content':'برنج درجه یک ایرانی ، یک سیح کباب لقمه زعفرانی و گوجه کبابی',
    'price':'470,000 تومان',
  },
  {
    'name':'چلو کباب کوبیده',
    'content':'برنج درجه یک ایرانی ، دو سیخ کوبیده ، گوجه کبابی',
    'price':'365,000 تومان',
  },
  {
    'name':'چلو ماهی مخصوص',
    'content':'برنج درجه یک ایرانی ، ماهی صید روز',
    'price':'560,000 تومان',
  },
  {
    'name':'استیک مرغ مخصوص با سس قارچ',
    'content':'سیب زمینی سرخ شده ، فیله مرغ ، سس مخصوص',
    'price':'370,000 تومان',
  },
  {
    'name':'شنیسل مرغ (سوخاری)',
    'content':'سیب زمینی سرخ شده ، فیله مرغ ، به همراه پودر سوخاری',
    'price':'370,000 تومان',
  },
  {
    'name': 'زرشک پلو با مرغ',
    'content': 'برنج درجه یک ایرانی ، سینه یا ران مرغ ، زرشک',
    'price': '285,000 تومان',
  },
  {
    'name': 'چلو خورشت روز',
    'content': 'قیمه سیب زمینی ، بادمجان ، قرمه سبزی ، گوجه بادمجان',
    'price': '235,000 تومان',
  },
  {
    'name': 'چلو کره',
    'content': 'برنج درجه یک ایرانی ، زعفران ، کره',
    'price': '130,000 تومان'
  },
  {
    'name': 'خوراک میرزاقاسمی',
    'content': 'بادمجان تنوری ، مغز گردو ، پیاز داغ ، سیر داغ ، گوجه و تخم مرغ',
    'price': '120,000 تومان'
  },
  {
    'name': 'خوراک باقلاقاتق',
    'content': 'باقلای محلی ، شوید ، تخم مرغ',
    'price': '120,000 تومان'
  },
  {
    'name': 'خوراک کشک بادمجان',
    'content': 'بادمجان تنوری ، مغزگردو ، پیاز داغ کشک ، نعناع',
    'price': '120,000 تومان'
  },
  {
    'name': 'بشقاب سبزیجات پخته (گرم)',
    'content': 'کلم بروکلی ، قارچ ، هویج ، کدو ، فلفل ،دلمه رنگی',
    'price': '180,000 تومان'
  },
];
  // {
  //   'name': 'چلو کوبیده مخصوص لقمه ای (تک سیخ)',
  //   'content': 'کباب لقمه ، دوچین ، گوجه',
  //   'price': '310,000 تومان',
  // },
  // {
  //   'name': 'چلو کوبیده نگین دار (تک سیخ)',
  //   'content': 'کوبیده ، جوجه رول شده ، دورچین ، گوجه',
  //   'price': '320,000 تومان',
  // },
  // {
  //   'name': 'چلو کوبیده معمولی (دوسیخ)',
  //   'content': 'کوبیده ، دورچین ، گوجه',
  //   'price': '280,000 تومان',
  // },
  
  // {
  //   'name': 'چلو کباب سلطانی',
  //   'content': 'کباب برگ ، گوشت کوبیده ، دورچین ، گوجه',
  //   'price': '570,000 تومان',
  // },
  
  // {
  //   'name': 'چلو کباب فیله (چنجه)',
  //   'content': 'گوشت فیله مرینت شده ، دورچین ، گوجه',
  //   'price': '440,000 تومان',
  // },
  // {
  //   'name': 'چلو جوجه کباب',
  //   'content': 'تیکه مرغ مرینت شده  دورچین ، گوجه',
  //   'price': '290,000 تومان',
  // },
  // {
  //   'name': 'چلو کباب جوجه ترش',
  //   'content': 'مرغ مرینت شده ، مغز گردو ، سبزی معطر ، دورچین ، گوجه',
  //   'price': '310,000 تومان',
  // },
  // {
  //   'name': 'چلو خورشت قیمه',
  //   'content': 'برنج درجه یک ایرانی',
  //   'price': '180,000 تومان',
  // },
  // {
  //   'name': 'چلو خورشت قورمه',
  //   'content': 'برنج درجه یک ایرانی',
  //   'price': '180,000 تومان',
  // },
  // {
  //   'name': 'چلو خورشت فسنجان',
  //   'content': 'برنج درجه یک ایرانی',
  //   'price': '310,000 تومان',
  // },
  // {
  //   'name': 'چلو خوراک ماهیچه مخصوص',
  //   'content': 'برنج درجه یک ایرانی ، ماهیچه پخته شده ، سس مخصوص',
  //   'price': '650,000 تومان',
  // },
  
  // {
  //   'name': 'چلو اکبر جوجه',
  //   'content':
  //       'برنج درجه یک ایرانی ، یک طرف جوجه مرینت شده ، کره محلی ، سس مخصوص',
  //   'price': '270,000 تومان',
  // },
  // {
  //   'name': 'چلو ماهی قزل آلا',
  //   'content': 'ماهی مرینت شده ، دورچین ، برنج درجه یک ایرانی',
  //   'price': '420,000 تومان',
  // },
  // {
  //   'name': 'میگو سوخاری',
  //   'content':
  //       'هفت عدد میگو مرینت و سوخاری ، سیب زمینی ، سس تار تار ، گوجه ، کاهو',
  //   'price': '410,000 تومان',
  // },
  // {
  //   'name': 'میگو کبابی',
  //   'content': 'پنچ عدد',
  //   'price': '410,000 تومان',
  // },
  // {
  //   'name': 'خوراک میگو کبابی',
  //   'content': 'هفت عدد میگو مرینت شده کبابی ، سیب زمینی ، دورچین مخصوص',
  //   'price': '410,000 تومان'
  // },
  // {
  //   'name': 'خوراک جوجه کباب',
  //   'content': 'جوجه مرینت شده به وزن 250 گرم ، دورچین',
  //   'price': '240,000 تومان'
  // },
  // {
  //   'name': 'خوراک کوبیده',
  //   'content': 'گوشت کوبیده 250 گرم ، دورچین',
  //   'price': '240,000 تومان'
  // },
  // {
  //   'name': 'پیتزا مخصوص',
  //   'content':
  //       'گوشت چرخ کرده ، کوکتل مرغ ، ژامبون مرغ ، قارچ فلفل دلمه ، پنیرپیتزا',
  //   'price': '320,000 تومان',
  // },
  // {
  //   'name': 'پیتزا گوشت قارچ',
  //   'content': 'گوشت چرخ کرده ، قارچ ، فلفل دلمه ، پنیرپیتزا',
  //   'price': '320,000 تومان',
  // },
  // {
  //   'name': 'پیتزا مرغ قارچ',
  //   'content': 'فیله مرغ ، قارچ ، فلفل دلمه ، پنیرپیتزا',
  //   'price': '280,000 تومان',
  // },
  // {
  //   'name': 'پیتزا پپرونی',
  //   'content': 'کالباس پپرونی ، قارچ ، فلفل دلمه ، پنیرپیتزا',
  //   'price': '310,000 تومان',
  // },
  // {
  //   'name': 'پیتزا رست بیف',
  //   'content': 'فیله گوساله خلال شده ، قارچ ، فلفل دلمه، پنیرپیتزا',
  //   'price': '340,000 تومان',
  // },
  // {
  //   'name': 'برگر مخصوص',
  //   'content': 'گوشت چرخ کرده گوساله ، کاهو ، گوجه ، خیارشور',
  //   'price': '190,000 تومان',
  // },
  // {
  //   'name': 'دوبل برگر',
  //   'content': 'دو عدد گوشت چرخ کرده گوساله ، کاهو ، گوجه ، خیارشور',
  //   'price': '250,000 تومان',
  // },
  // {
  //   'name': 'چیز برگر',
  //   'content': 'گوشت چرخ کرده گوساله ، پنیرگودا ، کاهو ، گوجه ، خیارشور',
  //   'price': '190,000 تومان',
  // },
  // {
  //   'name': 'چیکن برگر',
  //   'content': 'سینه مرغ ، کاهو ، گوجه ، خیارشور',
  //   'price': '190,000 تومان',
  // },
  // {
  //   'name': 'میرزا قاسمی',
  //   'content': 'بادمجان تنوری، مغز گردو، پیاز داغ، سیرداغ، گوجه، تخم مرغ',
  //   'price': '80,000 تومان'
  // },
  // {
  //   'name': 'کشک بادمجان',
  //   'content': 'بادمجان تنوری، مغز گردو، پیاز داع، کشک، نعناع',
  //   'price': '80,000 تومان'
  // },
  // {
  //   'name': 'بشقاب سبزیجات گرم',
  //   'content': 'کلم بروکلی، قارچ، هویج، کدو، فلفل دلمه رنگی',
  //   'price': '120,000 تومان'
  // },
  // {
  //   'name': 'چلو ساده',
  //   'content': '',
  //   'price': '50,000 تومان',
  // },
  // {
  //   'name': 'چلو کته',
  //   'content': '',
  //   'price': '70,000 تومان',
  // },
  // {
  //   'name': 'سبزی پلو',
  //   'content': '',
  //   'price': '70,000 تومان',
  // },
  // {
  //   'name': 'چلو میکس',
  //   'content': 'سبزی پلو ، ساده زعفرانی',
  //   'price': '100,000 تومان',
  // },
// {
//   'name': 'خوراک باقالا قاتوق',
//   'content': 'باقالای محلی، شوید، تخم مرغ',
//   'price': '90,000 تومان'
// },
// {
//   'name': 'چلو کباب برگ مخصوص',
//   'content': 'برنج درجه یک ایرانی، راسته گوساله، گوجه گبابی',
//   'price': '410,000 تومان'
// },
// {
//   'name': 'چلو جوجه کباب بدون استخوان',
//   'content': 'برنج درجه یک ایرانی، فیله مرغ، گوجه کبابی',
//   'price': '280,000 تومان'
// },
// {
//   'name': 'چلوکباب لقمه مخصوص',
//   'content': 'برنج درجه یک ایرانی، یک سیخ کباب لقمه زعفرانی، گوجه کبابی',
//   'price': '280,000 تومان'
// },
// {
//   'name': 'چلوکباب کوبیده',
//   'content': 'برنج درجه یک ایرانی، دو سیخ کوبیده، گوجه کبابی',
//   'price': '260,000 تومان'
// },
// {
//   'name': 'چلو ماهی مخصوص',
//   'content': 'برنج درجه یک ایرانی، ماهی صید روز',
//   'price': '360,000 تومان'
// },
// {
//   'name': 'استیک مرغ مخصوص',
//   'content': 'با سس قارچ، سیب زمینی سرخ شده، فیله مرغ، سس مخصوص',
//   'price': '280,000 تومان'
// },
// {
//   'name': 'شنیسل مرغ (سوخاری)',
//   'content': 'سیب زمینی سرخ شده، فیله مرغ به همراه پودر سوخاری',
//   'price': '280,000 تومان'
// },
// {
//   'name': 'چلو خورشت روز',
//   'content': 'قیمه، سیب زمینی، بادمجان، قورمه سبزی',
//   'price': '190,000 تومان'
// },


List<Map> frieds = [
  {
    'name': 'سیب زمینی مخصوص برج ساعت', 
    'price': '130,000 تومان',
  },
  {
    'name': 'سیب زمینی با پنیر', 
    'price': '120,000 تومان',
  },
  {
    'name': 'سیب زمینی ساده',
    'price': '90,000 تومان',
  },
  {
    'name': 'فیله سوخاری 4 تکه', 
    'price': '340,000 تومان',
    },
  {
    'name': 'فیله سوخاری 3 تکه',
    'price': '270,000 تومان',
  },
];

  // {'name': 'میگو سوخاری','price': '410,000 تومان',},
  // {'name': 'سیب زمینی مخصوص','price': '120,000 تومان',},


// done exept prices
List<Map> drinks = [
  {
    'name': 'ماءالشعیر قوطی',
    'price': 'نرخ مصوب',
  },
  {
    'name': 'نوشابه قوطی',
    'price': 'نرخ مصوب',
  },
  {
    'name': 'دوغ قوطی',
    'price': 'نرخ مصوب',
  },
  {
    'name': 'آب معدنی بزرگ',
    'price': 'نرخ مصوب',
  },
  {
    'name': 'آب معدنی کوچک',
    'price': 'نرخ مصوب',
  },
];


// done exept prices

List<Map> salads = [
  {
    'name': 'سالاد فصل',
    'price': '130,000 تومان',
  },
  {
    'name': 'سالاد شیرازی',
    'price': '130,000 تومان',
  },
  {
    'name': 'سالاد سزار',
    'price': '220,000 تومان',
  },
  {
    'name': 'ماست ساده',
    'price': '50,000 تومان',
  },
  {
    'name': 'ماست و خیار',
    'price': '60,000 تومان',
  },
  {
    'name': 'ماست و دلال', 
    'price': '60,000 تومان',
  },
  {
    'name': 'ماست موسیر', 
    'price': '60,000 تومان',
  },
  {
    'name': 'زیتون پرورده',
    'price': '110,000 تومان',
  },
  {
    'name': 'زیتون ساده',
    'price': '90,000 تومان',
  },
  {
    'name': 'سوپ روز',
    'price': '60,000 تومان',
  },
];


  // {
  //   'name': 'سیر ترشی',
  //   'price': '70,000 تومان',
  // },